In [2]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
%load_ext sql
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
%sql ibm_db_sa://rdl92017:zf7shlqmfd-1xwrw@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB

Requirement already satisfied: sqlalchemy==1.3.9 in /Users/macuser/opt/anaconda3/lib/python3.8/site-packages (1.3.9)
Requirement already satisfied: ibm_db_sa in /Users/macuser/opt/anaconda3/lib/python3.8/site-packages (0.3.6)
Requirement already satisfied: sqlalchemy>=0.7.3 in /Users/macuser/opt/anaconda3/lib/python3.8/site-packages (from ibm_db_sa) (1.3.9)
Requirement already satisfied: ibm-db>=2.0.0 in /Users/macuser/opt/anaconda3/lib/python3.8/site-packages (from ibm_db_sa) (3.0.4)
DB2/LINUXX8664

'Connected: rdl92017@BLUDB'

In [5]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
%sql select distinct(name), coltype, length from sysibm.syscolumns where tbname='CENSUS_DATA'; 
#%sql select distinct(COLNAME), TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'name'

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('COMMUNITY_AREA_NAME', 'VARCHAR ', 22),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('HARDSHIP_INDEX', 'SMALLINT', 2),
 ('PERCENT_AGED_16__UNEMPLOYED', 'DECIMAL ', 4),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA', 'DECIMAL ', 4),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64', 'DECIMAL ', 4),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'DECIMAL ', 4),
 ('PERCENT_OF_HOUSING_CROWDED', 'DECIMAL ', 4),
 ('PER_CAPITA_INCOME', 'INTEGER ', 4)]

In [6]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
#%sql select distinct(name), coltype, length from sysibm.syscolumns where tbname='CENSUS_DATA'; 
%sql select distinct(COLNAME), TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'CHICAGO_PUBLIC_SCHOOLS';

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('10th Grade PLAN (2009)', 'VARCHAR', 4),
 ('10th Grade PLAN (2010)', 'VARCHAR', 4),
 ('11th Grade Average ACT (2011)', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2009)', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2010)', 'VARCHAR', 4),
 ('AVERAGE_STUDENT_ATTENDANCE', 'VARCHAR', 6),
 ('Adequate_Yearly_Progress_Made_', 'VARCHAR', 3),
 ('Average_Teacher_Attendance', 'VARCHAR', 6),
 ('COLLEGE_ENROLLMENT', 'SMALLINT', 2),
 ('COMMUNITY_AREA_NAME', 'VARCHAR', 22),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('CPS_Performance_Policy_Level', 'VARCHAR', 15),
 ('CPS_Performance_Policy_Status', 'VARCHAR', 16),
 ('City', 'VARCHAR', 7),
 ('Collaborative_Name', 'VARCHAR', 34),
 ('College_Eligibility__', 'VARCHAR', 4),
 ('College_Enrollment_Rate__', 'VARCHAR', 4),
 ('Elementary, Middle, or High School', 'VARCHAR', 2),
 ('Environment_Icon', 'VARCHAR', 11),
 ('Environment_Score', 'SMALLINT', 2),
 ('Family_Involvement_Icon', 'VARCHAR', 11),
 ('Family_Involvement_Score', 'VARCHAR', 3),
 ('Freshman_on_Track_Rate__', 'VARCHAR', 4),
 ('General_Services_Route', 'SMALLINT', 2),
 ('Gr3_5_Grade_Level_Math__', 'VARCHAR', 4),
 ('Gr3_5_Grade_Level_Read__', 'VARCHAR', 4),
 ('Gr3_5_Keep_Pace_Math__', 'VARCHAR', 4),
 ('Gr3_5_Keep_Pace_Read__', 'VARCHAR', 4),
 ('Gr6_8_Grade_Level_Math__', 'VARCHAR', 4),
 ('Gr6_8_Grade_Level_Read__', 'VARCHAR', 4),
 ('Gr6_8_Keep_Pace_Math_', 'VARCHAR', 4),
 ('Gr6_8_Keep_Pace_Read__', 'VARCHAR', 4),
 ('Gr_8_Explore_Math__', 'VARCHAR', 4),
 ('Gr_8_Explore_Read__', 'VARCHAR', 4),
 ('Graduation_Rate__', 'VARCHAR', 4),
 ('HEALTHY_SCHOOL_CERTIFIED', 'VARCHAR', 3),
 ('ISAT_Exceeding_Math__', 'DECIMAL', 5),
 ('ISAT_Exceeding_Reading__', 'DECIMAL', 5),
 ('ISAT_Value_Add_Color_Math', 'VARCHAR', 6),
 ('ISAT_Value_Add_Color_Read', 'VARCHAR', 6),
 ('ISAT_Value_Add_Math', 'DECIMAL', 3),
 ('ISAT_Value_Add_Read', 'DECIMAL', 3),
 ('Individualized_Education_Program_Compliance_Rate', 'VARCHAR', 7),
 ('Instruction_Icon', 'VARCHAR', 11),
 ('Instruction_Score', 'SMALLINT', 2),
 ('Latitude', 'DECIMAL', 18),
 ('Leaders_Icon', 'VARCHAR', 4),
 ('Leaders_Score', 'VARCHAR', 3),
 ('Link', 'VARCHAR', 78),
 ('Location', 'VARCHAR', 27),
 ('Longitude', 'DECIMAL', 18),
 ('NAME_OF_SCHOOL', 'VARCHAR', 65),
 ('Net_Change_EXPLORE_and_PLAN', 'VARCHAR', 3),
 ('Net_Change_PLAN_and_ACT', 'VARCHAR', 3),
 ('Network_Manager', 'VARCHAR', 40),
 ('Parent_Engagement_Icon', 'VARCHAR', 7),
 ('Parent_Engagement_Score', 'VARCHAR', 3),
 ('Parent_Environment_Icon', 'VARCHAR', 7),
 ('Parent_Environment_Score', 'VARCHAR', 3),
 ('Phone_Number', 'VARCHAR', 14),
 ('Pk_2_Literacy__', 'VARCHAR', 4),
 ('Pk_2_Math__', 'VARCHAR', 4),
 ('Police_District', 'SMALLINT', 2),
 ('Rate_of_Misconducts__per_100_students_', 'DECIMAL', 5),
 ('SAFETY_SCORE', 'SMALLINT', 2),
 ('Safety_Icon', 'VARCHAR', 11),
 ('School_ID', 'INTEGER', 4),
 ('State', 'VARCHAR', 2),
 ('Street_Address', 'VARCHAR', 29),
 ('Students_Passing__Algebra__', 'VARCHAR', 4),
 ('Students_Taking__Algebra__', 'VARCHAR', 4),
 ('Teachers_Icon', 'VARCHAR', 11),
 ('Teachers_Score', 'VARCHAR', 3),
 ('Track_Schedule', 'VARCHAR', 12),
 ('Ward', 'SMALLINT', 2),
 ('X_COORDINATE', 'DECIMAL', 13),
 ('Y_COORDINATE', 'DECIMAL', 13),
 ('ZIP_Code', 'INTEGER', 4)]

In [7]:
%sql select distinct(COLNAME), TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME \
    = 'CHICAGO_CRIME_DATA';

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('ARREST', 'VARCHAR', 5),
 ('BEAT', 'SMALLINT', 2),
 ('BLOCK', 'VARCHAR', 35),
 ('CASE_NUMBER', 'VARCHAR', 8),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('DATE', 'DATE', 4),
 ('DESCRIPTION', 'VARCHAR', 46),
 ('DISTRICT', 'SMALLINT', 2),
 ('DOMESTIC', 'VARCHAR', 5),
 ('FBICODE', 'VARCHAR', 3),
 ('ID', 'INTEGER', 4),
 ('IUCR', 'VARCHAR', 4),
 ('LATITUDE', 'DECIMAL', 18),
 ('LOCATION', 'VARCHAR', 29),
 ('LOCATION_DESCRIPTION', 'VARCHAR', 33),
 ('LONGITUDE', 'DECIMAL', 18),
 ('PRIMARY_TYPE', 'VARCHAR', 33),
 ('WARD', 'SMALLINT', 2),
 ('X_COORDINATE', 'INTEGER', 4),
 ('YEAR', 'SMALLINT', 2),
 ('Y_COORDINATE', 'INTEGER', 4)]

In [12]:
#Problem 1: Find the total number of crimes recorded in the CRIME table
%sql select count(*) from CHICAGO_CRIME_DATA;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('533'),)]

In [11]:
#Problem 2: List community areas with per capita income less than 11000
%sql select COMMUNITY_AREA_NAME, PER_CAPITA_INCOME from CENSUS_DATA where PER_CAPITA_INCOME<11000;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('West Garfield Park', 10934),
 ('South Lawndale', 10402),
 ('Fuller Park', 10432),
 ('Riverdale', 8201)]

In [ ]:
#Problem 3: List all case numbers for crimes involving minors

In [28]:
%%sql select CASE_NUMBER,PRIMARY_TYPE, DESCRIPTION  
from CHICAGO_CRIME_DATA where DESCRIPTION like '%MINOR%' 
 ;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('HL266884', 'LIQUOR LAW VIOLATION', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'LIQUOR LAW VIOLATION', 'ILLEGAL CONSUMPTION BY MINOR')]

In [29]:
%%sql select CASE_NUMBER,PRIMARY_TYPE, DESCRIPTION  
from CHICAGO_CRIME_DATA where DESCRIPTION like '%MINOR%'  OR DESCRIPTION LIKE '%CHILD%'
 ;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('HN567387', 'OFFENSE INVOLVING CHILDREN', 'AGG SEX ASSLT OF CHILD FAM MBR'),
 ('HR391350', 'OFFENSE INVOLVING CHILDREN', 'SEX ASSLT OF CHILD BY FAM MBR'),
 ('HL266884', 'LIQUOR LAW VIOLATION', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'LIQUOR LAW VIOLATION', 'ILLEGAL CONSUMPTION BY MINOR'),
 ('HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

In [31]:
%%sql select CASE_NUMBER,PRIMARY_TYPE, DESCRIPTION  
from CHICAGO_CRIME_DATA where DESCRIPTION LIKE '%MINOR%' 
OR DESCRIPTION LIKE '%CHILD%' OR PRIMARY_TYPE like '%CHILD%' ;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('HN567387', 'OFFENSE INVOLVING CHILDREN', 'AGG SEX ASSLT OF CHILD FAM MBR'),
 ('HR391350', 'OFFENSE INVOLVING CHILDREN', 'SEX ASSLT OF CHILD BY FAM MBR'),
 ('HM768251', 'OFFENSE INVOLVING CHILDREN', 'CRIM SEX ABUSE BY FAM MEMBER'),
 ('HT394616', 'OFFENSE INVOLVING CHILDREN', 'AGG CRIM SEX ABUSE FAM MEMBER'),
 ('HL266884', 'LIQUOR LAW VIOLATION', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'LIQUOR LAW VIOLATION', 'ILLEGAL CONSUMPTION BY MINOR'),
 ('HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

In [ ]:
#Problem 4: List all kidnapping crimes involving a child

In [35]:
%%sql select CASE_NUMBER,PRIMARY_TYPE, DESCRIPTION  from CHICAGO_CRIME_DATA 
where  CASE_NUMBER IN (select CASE_NUMBER from CHICAGO_CRIME_DATA where DESCRIPTION LIKE '%MINOR%' 
OR DESCRIPTION LIKE '%CHILD%' OR PRIMARY_TYPE like '%CHILD%') AND PRIMARY_TYPE LIKE '%KIDNAP%';

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

In [ ]:
#Problem 5: What kind of crimes were recorded at schools?

In [38]:
%%sql SELECT  DISTINCT(PRIMARY_TYPE)  from CHICAGO_CRIME_DATA WHERE
LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('ASSAULT',),
 ('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('CRIMINAL TRESPASS',),
 ('NARCOTICS',),
 ('PUBLIC PEACE VIOLATION',)]

In [ ]:
#Problem 6: List the average safety score for all types of schools (for ecah type)

In [173]:
%%sql select  "Elementary, Middle, or High School", 
              avg(SAFETY_SCORE) as SAFETY_SCORE_PER_SCHOOL_TYPE from CHICAGO_PUBLIC_SCHOOLS
               GROUP BY "Elementary, Middle, or High School"

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('ES', Decimal('49.520383')),
 ('HS', Decimal('49.623529')),
 ('MS', Decimal('48.000000'))]

In [46]:
%sql select avg(SAFETY_SCORE) as AVERAGE_SAFETY_SCORE from CHICAGO_PUBLIC_SCHOOLS

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('49.504873'),)]

In [ ]:
#Problem 7: List 5 community areas with highest % of households below poverty line

In [47]:
%%sql select COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER, PERCENT_HOUSEHOLDS_BELOW_POVERTY 	
    from CENSUS_DATA order by PERCENT_HOUSEHOLDS_BELOW_POVERTY desc limit 5;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Riverdale', 54, Decimal('56.5')),
 ('Fuller Park', 37, Decimal('51.2')),
 ('Englewood', 68, Decimal('46.6')),
 ('North Lawndale', 29, Decimal('43.1')),
 ('East Garfield Park', 27, Decimal('42.4'))]

In [ ]:
#Problem 8: Which community area(number) is most crime prone?

In [72]:
%%sql select COMMUNITY_AREA_NUMBER, COUNT(COMMUNITY_AREA_NUMBER) AS TOTAL_CRIMES_PER_AREA
    from CHICAGO_CRIME_DATA 
    GROUP BY COMMUNITY_AREA_NUMBER ORDER BY TOTAL_CRIMES_PER_AREA DESC LIMIT 1;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(25, Decimal('43'))]

In [ ]:
#Problem 9: Use a sub-query to find the name of the community area with highest hardship index.

In [117]:
%%sql Select DISTINCT CPS.COMMUNITY_AREA_NAME, CD.COMMUNITY_AREA_NAME, 
      CD.COMMUNITY_AREA_NUMBER, CD.HARDSHIP_INDEX from 
      CENSUS_DATA AS CD, CHICAGO_PUBLIC_SCHOOLS AS CPS 
        WHERE CD.COMMUNITY_AREA_NUMBER= CPS.COMMUNITY_AREA_NUMBER
        AND CD.COMMUNITY_AREA_NUMBER IN (SELECT COMMUNITY_AREA_NUMBER FROM CENSUS_DATA 
      ORDER BY HARDSHIP_INDEX DESC NULLS LAST LIMIT 1) ;

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('RIVERDALE', 'Riverdale', 54, 98)]

In [ ]:
#Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?

In [148]:
%%sql Select distinct CD.COMMUNITY_AREA_NAME, 
      CD.COMMUNITY_AREA_NUMBER from 
      CENSUS_DATA as CD,  CHICAGO_CRIME_DATA as CCD
        WHERE CD.COMMUNITY_AREA_NUMBER = CCD.COMMUNITY_AREA_NUMBER
        AND CCD.COMMUNITY_AREA_NUMBER IN ( select COMMUNITY_AREA_NUMBER from CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER order by count(COMMUNITY_AREA_NUMBER) DESC LIMIT 1)

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Austin', 25)]

In [147]:
%%sql select COMMUNITY_AREA_NUMBER, count(COMMUNITY_AREA_NUMBER) from CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER order by count(COMMUNITY_AREA_NUMBER) DESC LIMIT 1

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(25, Decimal('43'))]

In [ ]:
#EXAM QUESTIONS

In [ ]:
#EXTRA HOW MANY CRIMES INVOLVE AN ARREST

In [152]:
%sql select count(ARREST) from CHICAGO_CRIME_DATA WHERE ARREST='TRUE'

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('163'),)]

In [ ]:
#Given the subset of the Chicago crime dataset provided in the course,
#what are the correct values in the result set for:

In [153]:
%%sql SELECT  DISTINCT(PRIMARY_TYPE)  from CHICAGO_CRIME_DATA WHERE
LOCATION_DESCRIPTION LIKE '%GAS STATION%'

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('CRIMINAL TRESPASS',), ('NARCOTICS',), ('ROBBERY',), ('THEFT',)]

In [ ]:
#Which schools in Community Areas 10 to 15 are healthy school certified?

In [160]:
%%sql select NAME_OF_SCHOOL from CHICAGO_PUBLIC_SCHOOLS where 
     HEALTHY_SCHOOL_CERTIFIED='Yes' and COMMUNITY_AREA_NUMBER between 10 and 15

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('Rufus M Hitch Elementary School',)]

In [ ]:
#PROBLEM 8: List the top 5 Community Areas by average College Enrollment [number of students]

In [163]:
%%sql select COMMUNITY_AREA_NAME, AVG(COLLEGE_ENROLLMENT) as AVG_ENROLLMENT from CHICAGO_PUBLIC_SCHOOLS 
       group by COMMUNITY_AREA_NAME order by AVG_ENROLLMENT desc limit 5

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('ARCHER HEIGHTS', Decimal('2411.500000')),
 ('MONTCLARE', Decimal('1317.000000')),
 ('WEST ELSDON', Decimal('1233.333333')),
 ('BRIGHTON PARK', Decimal('1205.875000')),
 ('BELMONT CRAGIN', Decimal('1198.833333'))]

In [ ]:
# Use a sub-query to determine which Community Area has the least value for school Safety Score?

In [168]:
%%sql  select COMMUNITY_AREA_NAME, SAFETY_SCORE from chicago_public_schools where
        SAFETY_SCORE = ( select MIN(SAFETY_SCORE) from chicago_public_schools )

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('WASHINGTON PARK', 1)]

In [ ]:
#PROBLEM 10: [Without using an explicit JOIN operator] Find the Per Capita Income of the Community 
#Area which has a school Safety Score of 1

In [171]:
%%sql select community_area_number, community_area_name, per_capita_income from census_data where community_area_number = 
       ( select community_area_number from chicago_public_schools where safety_score =1 )

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(40, 'Washington Park', 13785)]

In [ ]:
#method b  without join operator

In [172]:
%%sql select CD.community_area_number, CD.community_area_name, 
        CD.per_capita_income from census_data CD, 
    chicago_public_schools CPS where CD.community_area_number=CPS.community_area_number
        and CPS.safety_score = 1

 * ibm_db_sa://rdl92017:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(40, 'Washington Park', 13785)]